---
title: "在Cisco IOS上啟用免密碼SSH登入"
date: 2020-11-17T15:36:33+08:00
draft: false
categories: [Operation]
tags: [IOS]
isCJKLanguage: true
---

覺得將來可能會用到所以筆記下來
<!--more-->

模擬設備是用Cisco IOL，IOS版本是15.5
```
Router>show version
Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.5(2)T, DEVELOPMENT TEST SOFTWARE
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Thu 26-Mar-15 07:36 by prod_rel_team

ROM: Bootstrap program is Linux
```
<br></br>

首先設定ssh，並建立一個local user
```
Router>enable 
Router#configure terminal 
Router(config)#hostname R1
R1(config)#ip ssh version 2        
R1(config)#crypto key generate rsa 
R1(config)#username admin privilege 15 secret 12345678
```
<br></br>

設定好line就能ssh登入了
```
R1(config)#line vty 0 4
R1(config-line)#transport input ssh
R1(config-line)#login local 
```
<br></br>

接下來準備測試用的key pair，一般般的rsa
```
$ ssh-keygen -t rsa -b 4096
$ cat .ssh/id_rsa.pub
ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ/RNys...
```
<br></br>

回到router上，使用以下指令，進入R1(conf-ssh-pubkey-data)#時就把public key分段段一點一點丟上去，exit後就儲存了
```
R1(config)#ip ssh pubkey-chain
R1(conf-ssh-pubkey)#username admin
R1(conf-ssh-pubkey-user)#key-string 
R1(conf-ssh-pubkey-data)#ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ/RNys                                       
...
R1(conf-ssh-pubkey-data)#exit
```
<br></br>

最後設定public key認證
```
R1(config)#ip ssh server authenticate user publickey
```
<br></br>

完成後就可以直接測試了，應該像是這樣的結果
```
$ ssh admin@192.168.171.201
R1#
```